# ООП и як стили коднависяй. хама чизе ки мо мебинем да программирование ба ООП классо сохта шидагиян мисол int,string

# ООП 4 принсип дора Наследство Полиморфизм Инкапсулация Абстакрсия

# АБСТРАКСИЯ скрыт кадани подробности даруни класс ва нишон додани информацияои важнийяй 

# абстрактметод ягон методе ки да класс сохта шидагиян барои дига классое ки и ай класс наследство мекнан бояд хами метода реализовать кнан

# Инкапсулация я принсипи ООП ай ки барои скрыть кадани информацияхои даруни класс ва защита ай доступи берунахай

# 3 област видимости дора public ,_protected,__private

# полиморфизм и яке ай принсипои ООП ай ки да дурунш методе дора ки да я класс дига кор мекна да дига класс дига кора

# наследство яке ай принсипои ООП ай ки барои я кода чанд бор нанавистан истифода мешава

# мода доступ мета ки методу атрибутои дига класса истифода барем 

# @staticmethod методе ки да даруни класс сохта шидагияй но да классу объект зависимый нест

# @classmethod барои контрол кадани class атрибуто истифлда мешава ва катиш я атрибути cls мегираву тока да class атрибуто доступ дора ва метона объект соза

# lamda як намуди функцияи майдае хастай ки да я хат строка нависта мешава барои вазифахои майда

# List complehetions шакли кутох навистани лист да я линия

# @property я декораторе хастай ки метона методора атрибут кна 

# @setter декораторе хастай ки мода доступ мета значенияи приватный атрибута берун ай класс алиш кнем

